tap "azure/kubelogin"
tap "cmacrae/formulae"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "keith/formulae"
tap "koekeishiya/formulae"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "surrealdb/tap"
brew "act"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "aria2"
brew "atuin"
brew "python@3.10"
brew "autojump"
brew "boost"
brew "azure-cli"
brew "bandwhich"
brew "bat"
brew "node"
brew "bitwarden-cli"
brew "bpytop"
brew "cabextract"
brew "glib"
brew "eigen"
brew "gcc"
brew "suite-sparse"
brew "tbb"
brew "ceres-solver"
brew "coreutils"
brew "ctop"
brew "curl"
brew "harfbuzz"
brew "cypher-shell"
brew "dive"
brew "dog"
brew "dos2unix"
brew "dua-cli"
brew "duf"
brew "exa"
brew "unbound"
brew "openjpeg"
brew "leptonica"
brew "libarchive"
brew "libass"
brew "libbluray"
brew "pango"
brew "ffmpeg"
brew "ffmpeg@4"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "git"
brew "python@3.11"
brew "git-filter-repo"
brew "glab"
brew "glances"
brew "glfw"
brew "go"
brew "gobject-introspection"
brew "gping"
brew "gradle"
brew "groonga"
brew "hdf5"
brew "helm"
brew "htop"
brew "ifstat"
brew "libheif"
brew "python@3.9"
brew "libraw"
brew "imagemagick"
brew "jq"
brew "k9s"
brew "kotlin"
brew "ktlint"
brew "kubernetes-cli"
brew "lastpass-cli"
brew "libpq", link: true
brew "librealsense"
brew "lsd"
brew "mailhog"
brew "mariadb", restart_service: true
brew "maven"
brew "molten-vk"
brew "navi"
brew "neovim"
brew "netcdf"
brew "newsboat"
brew "numpy"
brew "vtk"
brew "opencv"
brew "openjdk@11"
brew "openjdk@17"
brew "pass"
brew "sbcl"
brew "pgloader"
brew "pillow"
brew "pnpm"
brew "pulumi"
brew "qt@5"
brew "ripgrep"
brew "rm-improved"
brew "rust"
brew "s3cmd"
brew "starship"
brew "switchaudio-osx"
brew "telnet"
brew "thefuck"
brew "vim"
brew "wimlib"
brew "yarn"
brew "azure/kubelogin/kubelogin"
brew "cmacrae/formulae/spacebar"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "keith/formulae/reminders-cli"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
brew "qmk/qmk/qmk"
brew "surrealdb/tap/surreal"
cask "anaconda"
cask "arc"
cask "arduino"
cask "bitwarden"
cask "bluetility"
cask "chatgpt"
cask "cmake"
cask "crossover"
cask "discord"
cask "firefox"
cask "firefox-developer-edition"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "google-chrome"
cask "hammerspoon"
cask "iterm2"
cask "jetbrains-toolbox"
cask "lens"
cask "logseq"
cask "meetingbar"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-teams"
cask "nordvpn"
cask "notion"
cask "prusaslicer"
cask "qmk-toolbox"
cask "raycast"
cask "rustdesk"
cask "sf-symbols"
cask "signal"
cask "slack"
cask "spotify"
cask "teamviewer"
cask "tunnelblick"
cask "ultimaker-cura"
cask "visual-studio-code"
cask "wezterm"
cask "zulu"
cask "zulu17"
cask "zulu21"
vscode "DanielSanMedium.dscodegpt"
vscode "eamodio.gitlens"
vscode "GitHub.copilot"
vscode "GitHub.copilot-labs"
vscode "hbenl.vscode-test-explorer"
vscode "JScearcy.rust-doc-viewer"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.test-adapter-converter"
vscode "panicbit.cargo"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "Swellaby.vscode-rust-test-adapter"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
vscode "Zerotaskx.rust-extension-pack"
