tap "azure/kubelogin"
tap "cjsaylor/tap"
tap "cmacrae/formulae"
tap "felixkratz/formulae"
tap "graalvm/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "kardolus/chatgpt-cli"
tap "keith/formulae"
tap "koekeishiya/formulae"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "sachaos/todoist"
tap "shopify/shopify"
tap "surrealdb/tap"
tap "ynqa/tap"
brew "act"
brew "glib"
brew "harfbuzz"
brew "ant"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "aria2"
brew "atuin"
brew "python@3.10"
brew "autojump"
brew "boost"
brew "libusb"
brew "awscli"
brew "azure-cli"
brew "bandwhich"
brew "bat"
brew "node"
brew "bitwarden-cli"
brew "bpytop"
brew "cabextract"
brew "carapace"
brew "eigen"
brew "gcc"
brew "suite-sparse"
brew "tbb"
brew "ceres-solver"
brew "pkgconf"
brew "hdf5"
brew "cmake", link: false
brew "commitizen"
brew "coreutils"
brew "ctop"
brew "curl"
brew "cypher-shell"
brew "dive"
brew "docker-compose"
brew "dog"
brew "dos2unix"
brew "dua-cli"
brew "duf"
brew "eza"
brew "fd"
brew "unbound"
brew "openjpeg"
brew "leptonica"
brew "libarchive"
brew "libass"
brew "libbluray"
brew "pango"
brew "ffmpeg"
brew "ffmpeg@4"
brew "ffmpegthumbnailer"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-filter-repo"
brew "gitui"
brew "glab"
brew "glances"
brew "glfw"
brew "gnu-sed"
brew "go@1.21"
brew "gobject-introspection"
brew "golangci-lint"
brew "gomplate"
brew "gping"
brew "gradle"
brew "groonga"
brew "hcloud"
brew "helm"
brew "htop"
brew "ifstat"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "jq"
brew "k3d"
brew "k9s"
brew "kafka"
brew "kotlin"
brew "ktlint"
brew "kubebuilder"
brew "kubernetes-cli"
brew "lastpass-cli"
brew "lazygit"
brew "libpq", link: true
brew "librealsense"
brew "llvm"
brew "lsd"
brew "lua"
brew "mailhog"
brew "mariadb", restart_service: :changed
brew "maven"
brew "minikube"
brew "mkcert"
brew "molten-vk"
brew "navi"
brew "neovim"
brew "netcdf"
brew "newsboat"
brew "nowplaying-cli"
brew "numpy"
brew "nushell"
brew "ollama"
brew "vtk"
brew "opencv"
brew "openjdk@11"
brew "openjdk@17"
brew "openstackclient"
brew "pass"
brew "sbcl"
brew "pgloader"
brew "pillow"
brew "pint"
brew "pnpm"
brew "poppler"
brew "pulumi"
brew "python@3.11"
brew "python@3.9"
brew "qt@5"
brew "ripgrep"
brew "rm-improved"
brew "rustup"
brew "s3cmd"
brew "sevenzip"
brew "sshuttle"
brew "starship"
brew "switchaudio-osx"
brew "sysdig"
brew "talisman"
brew "telnet"
brew "thefuck"
brew "unar"
brew "vim"
brew "watson"
brew "wimlib"
brew "yarn"
brew "yazi"
brew "yq"
brew "zoxide"
brew "azure/kubelogin/kubelogin"
brew "cjsaylor/tap/jrnl"
brew "cmacrae/formulae/spacebar"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "felixkratz/formulae/svim"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
brew "kardolus/chatgpt-cli/chatgpt-cli"
brew "keith/formulae/reminders-cli"
brew "qmk/qmk/qmk"
brew "sachaos/todoist/todoist", link: false
brew "shopify/shopify/shopify-cli"
brew "surrealdb/tap/surreal"
brew "ynqa/tap/jnv"
cask "aerospace"
cask "anaconda"
cask "arduino"
cask "bambu-studio"
cask "bluetility"
cask "brave-browser"
cask "chatgpt"
cask "cmake"
cask "discord"
cask "displaylink"
cask "elgato-stream-deck"
cask "figma"
cask "firefox"
cask "firefox@developer-edition"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-monaspace"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-symbols-only-nerd-font"
cask "graalvm-community-jdk21"
cask "homerow"
cask "jetbrains-toolbox"
cask "keystore-explorer"
cask "meetingbar"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-remote-desktop"
cask "microsoft-teams"
cask "obsidian"
cask "postman"
cask "powershell"
cask "proton-mail-bridge"
cask "raycast"
cask "rustdesk"
cask "sf-symbols"
cask "signal"
cask "slack"
cask "spotify"
cask "teamviewer"
cask "thunderbird"
cask "todoist"
cask "tunnelblick"
cask "visual-studio-code"
cask "vlc"
cask "wezterm@nightly"
cask "whatsapp"
cask "yubico-yubikey-manager"
cask "zulu"
cask "zulu@17"
cask "zulu@21"
vscode "ardenivanov.svelte-intellisense"
vscode "danielsanmedium.dscodegpt"
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "hbenl.vscode-test-explorer"
vscode "jscearcy.rust-doc-viewer"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "svelte.svelte-vscode"
vscode "swellaby.vscode-rust-test-adapter"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
vscode "zerotaskx.rust-extension-pack"
